posts/2016-02-01-outside-the-beautiful-gate.org
#+date: <2016-02-01>
#+filetags: prayer religion
#+title: Outside the Beautiful Gate

God of compassion,

Peter and John met a man\\
asking for alms\\
at the Beautiful Gate\\
of the temple.

We are not like Peter and John,\\
when they met the man\\
at the Beautiful Gate,\\
for we do have\\
silver and gold\\
to give.

But before we give,\\
we pray that you\\
would examine our hearts.

Do we give to maintain\\
the myth of our own superiority?

Do we give as a a means of exercising power?

Or do we give in a way that recognizes the\\
other person as one who bears\\
the image of Christ himself?

"Look at us," Peter said.

Look at us, Lord.\\
Look with us.\\
Look through us.

Help us to see the ones\\
sitting outside our own\\
Beautiful Gates.

Amen


#+begin_tagline
Tagged: prayer religion
#+end_tagline
