docs/posts/2016-02-01-outside-the-beautiful-gate.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 23, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Outside the Beautiful Gate</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Outside the Beautiful Gate</h1>
<p class="subtitle" role="doc-subtitle">Feb 01, 2016</p>
</header><p>
God of compassion,
</p>

<p>
Peter and John met a man<br>
asking for alms<br>
at the Beautiful Gate<br>
of the temple.
</p>

<p>
We are not like Peter and John,<br>
when they met the man<br>
at the Beautiful Gate,<br>
for we do have<br>
silver and gold<br>
to give.
</p>

<p>
But before we give,<br>
we pray that you<br>
would examine our hearts.
</p>

<p>
Do we give to maintain<br>
the myth of our own superiority?
</p>

<p>
Do we give as a a means of exercising power?
</p>

<p>
Or do we give in a way that recognizes the<br>
other person as one who bears<br>
the image of Christ himself?
</p>

<p>
&ldquo;Look at us,&rdquo; Peter said.
</p>

<p>
Look at us, Lord.<br>
Look with us.<br>
Look through us.
</p>

<p>
Help us to see the ones<br>
sitting outside our own<br>
Beautiful Gates.
</p>

<p>
Amen
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 23, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
